import { IPeriodData } from "./types/types";

export const PERIOD_DATA: IPeriodData = [
    [
        {
            id: 1,
            year: 2015,
            text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
        },
        {
            id: 2,
            year: 2016,
            text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
        },
        {
            id: 3,
            year: 2017,
            text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
        },
        {
            id: 4,
            year: 2018,
            text: "Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца",
        },
        {
            id: 5,
            year: 2019,
            text: "Google объявил о создании 53-кубитного квантового компьютера.",
        },
        {
            id: 6,
            year: 2020,
            text: "Корабль Crew Dragon вернулся на Землю из первого пилотируемого полета",
        },
    ],
    [
        {
            id: 7,
            year: 1987,
            text: '"Хищник"/Predator, США (реж. Джон Мактиран)',
        },
        {
            id: 8,
            year: 1988,
            text: '"Кто подставил кролика Роджера"/Who framed Roger Rabbit, США(реж. Роберт Земекис)',
        },
        {
            id: 9,
            year: 1989,
            text: '"Назад в будущее 2"/ Back To The Future 2, США (реж, Роберт Земекис)',
        },
        {
            id: 10,
            year: 1990,
            text: '"Крепкий орешек 2"/ Die Hard 2, США(реж. Ренни Харлин)',
        },
        {
            id: 11,
            year: 1991,
            text: '"Семейка Адамс" / The Addams Family, США, (реж. Барри Зонненфельд)',
        },
    ],
    [
        {
            id: 12,
            year: 1992,
            text: "Подписание Маастрихтского договора, положившего начало Европейскому Союзу.",
        },
        {
            id: 13,
            year: 1994,
            text: "Запуск первого веб-браузера Netscape Navigator."
        },
        {
            id: 14,
            year: 1995,
            text: "Выход операционной системы Windows 95, ставшей революционной в мире персональных компьютеров.",
        },
        {
            id: 14,
            year: 1995,
            text: "Открытие первой планеты вне Солнечной системы — 51 Пегаса b.",
        },
        {
            id: 14,
            year: 1995,
            text: "Мировая премьера фильма 'История игрушек' — первого полнометражного анимационного фильма, созданного с помощью компьютерной графики.",
        }
    ],
    [
        {
            id: 15,
            year: 2000,
            text: "Создание Международной космической станции (МКС) как символа международного сотрудничества в космосе.",
        },
        {
            id: 16,
            year: 2004,
            text: "Основание социальной сети Facebook Марком Цукербергом."
        },
        {
            id: 17,
            year: 2007,
            text: "Презентация первого iPhone Стивом Джобсом, что ознаменовало начало эры смартфонов.",
        },
        {
            id: 17,
            year: 2008,
            text: "Запуск биткойна — первой в мире децентрализованной криптовалюты.",
        }
    ],
    [
        {
            id: 18,
            year: 1987,
            text: '"Хищник"/Predator, США (реж. Джон Мактиран)',
        },
        {
            id: 19,
            year: 1988,
            text: '"Кто подставил кролика Роджера"/Who framed Roger Rabbit, США(реж. Роберт Земекис)',
        },
        {
            id: 20,
            year: 1989,
            text: '"Назад в будущее 2"/ Back To The Future 2, США (реж, Роберт Земекис)',
        },
        {
            id: 21,
            year: 1990,
            text: '"Крепкий орешек 2"/ Die Hard 2, США(реж. Ренни Харлин)',
        },
        {
            id: 22,
            year: 1991,
            text: '"Семейка Адамс" / The Addams Family, США, (реж. Барри Зонненфельд)',
        },
    ],
    [
        {
            id: 23,
            year: 2010,
            text: "Запуск социальной сети Instagram, которая стала одной из самых популярных платформ для обмена фото и видео.",
        },
        {
            id: 24,
            year: 2012,
            text: "Открытие бозона Хиггса на Большом адронном коллайдере — важнейшее событие в физике элементарных частиц."
        },
        {
            id: 25,
            year: 2015,
            text: "Подписание Парижского соглашения по климату, направленного на борьбу с изменением климата.",
        }
    ],
];
